How to use funktion in itself

In [254]:
num = "345679873457"

def lik(x):
    sum_num = 0
    for i in str(x):
        sum_num += int(i)
    return sum_num if sum_num< 10 else lik(sum_num)

lik(num)

5

How to use dict as list comprehensions

In [162]:
name = {"sdf", "ali", "mosse"}
last_name = {"son", "abo", "nas"}
name1 = dict(Ai = 23, age = 34, adress = "Julias") # det går snabbare att skriva 

dict_nam = {name:last_name for name, last_name in zip(name, last_name)} # first way
dic_nam = dict(zip(name, last_name)) # second way
print(name1)
print(dic_nam)

{'Ai': 23, 'age': 34, 'adress': 'Julias'}
{'mosse': 'son', 'sdf': 'abo', 'ali': 'nas'}

How to use join string put togather to string.

we can only use them on iterable variables.

In [18]:
name = "aasdfdddsbbdffff"
print("".join(sorted(set(name))))
print("_".join(sorted(set(name))))

abdfs
a_b_d_f_s

How to use map

In [ ]:
def addition(n):
    return n + n
# map()- funktionen returnerar ett kartobjekt (som är en iterator)
# We double all numbers using map()
numbers = (1, 2, 3, 4)
result = map(addition, numbers)

result1 = map(lambda x: x + x, numbers)
print(list(result1))

How to use bin(), sqrt()

In [21]:
de = 25 ** 0.5 # rotten ur
print(de)

def num(x):
    return int(bin(x)[2:]) # == bin(n).count("1") # it finds binary number

num(23)

5.0

'0b11101001'

How to use ord() and chr()  

so chr() take in a number gave you the letters and ord() does the opposit of it

In [40]:
lis = ["a", "d"] # find the missing letters between
be = list(map(chr, range(ord(lis[0]), ord(lis[-1])+1))) # chr find the character by the number 
de = [x for x in be if x not in lis]                    # ord find the the number of character
de

['b', 'c']

how to find uniqe values in a list, touple or set.

In [70]:
de = [3,3,1,4,1, 1, 1, 1]
a, b, c = set(de)
print(a, b, c)

1 3 4

how to convert a string touple to touple

In [98]:
from ast import literal_eval

num = "(23, 34)"
num_new = literal_eval(num)
num_new

(23, 34)

How to use with open and import re

In [336]:
import re

te = []
with open("testpoints.txt") as file:
    rest = r"\(.+, .+\)"
    text = file.read()
    for x in re.findall(rest, text):
        te.append(x)
te
# funktioner som producorer 
# Vad konstanter är; det variable som värdet går inte att ändrar.

['(25, 32)', '(24.2, 31.5)', '(22, 34)', '(20.5, 34)']

@ cache is good to use it for producors funktione that does not need to runs every time that calls

In [133]:
from functools import cache

@cache
def lik():
    return "your best mr:"

de = lik() + "mosse"
de

'your best mr:mosse'

how t use @dataclass decorator

In [160]:
from dataclasses import dataclass
from typing import ClassVar

@dataclass
class One():
    num: int
    nu: int
    class_var: ClassVar[int] = 100 # skapa class variable

    def lik(self):
        return self.nu + self.num
    

na = One( 5, 5)
n = One( 3, 3)
print(na.lik() * n.lik())

@dataclass
class D:
    name:str
    last_name: str

def main():
    person = D("sd", "sdf")
    print(person)

if __name__ == "__main__":
    main()

60
D(name='sd', last_name='sdf')

# how to use seed in random

In [170]:
import random as rng
rng.seed(2) # det för att man får samma resultat i sina random värde 
num = rng.randint(1, 6)
print(num)

1

# How to use execel file

In [ ]:
import pandas as pd
df = pd.read_excel()
df = pd.read_json()

# How to build a Series

In [ ]:
import pandas as pd

num = [1, 2, 3, 4, 5]
index_num = ["a", "b", "c", "d", "e"]

ser = pd.Series(num, index = index_num) # you can choose the index or it vill gave index as number
df = ser.to_frame() # converting a Series to dataframe

tt = pd.Series({"f": 6, "h": 7}) # create a new Series
df = pd.concat([df, tt.to_frame()], ignore_index= True) # put the new Series to end of dataframe "df"
tf = pd.concat([df, tt.to_frame().T]) # if use Transpose it will make columns instead.
df.T # make it to transpose

name = ["ali", "alex", "mosa", "saber", "nar"]
dff = pd.DataFrame({"name": name})
dff[0] = df[0]
dff = dff.reset_index(drop = True) # to reset the index of a dataframe

# how to use metod in class and @statisticmetod, @classmetod

In [358]:
class d:
    age = 23 # class variable 
    name = "ali"

    def __init__(self, num, nu):
        self.num = num
        self.nu = nu
    
    def likk(self): 
        return self.num * self.nu
    
    def __add__(self, xd): # method som möjlig gör att objecter kan adderas tillsammans
        return self.likk() + xd.likk()

    @classmethod
    def lk(de): # methoden tar bara in class variablar och andvänder sig inte av self
        return f"your age is {de.age} and your name is {de.name}"
    
    @staticmethod
    def new(c, b): # denna methoden utgör olika typer av beräkningar 
        return 23 * 2/ 3 + c * b
    
one = d(23, 3)
two = d(2, 5)
print(d.lk())
print(d.new(2, 5))
print(one + two)

your age is 23 and your name is ali
25.333333333333336
79

#importerar dataset from seaborn

In [2]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True